{
    "intro_text": ["Proficient in machine learning technologies with consolidated knowledge in both supervised and unsupervised algorithms, covering a wide range of toolkits including decision trees, support vector machines, gradient descent for loss optimization, isolation forest, and so on.",
        "Proven capability through hands-on experience in solving real data science problems using Numpy, Scikit-learn, Tensorflow and way more other libraries and platforms, and handling end-to-end machine learning pipelines from data processing, feature engineering, model training to output validation."
    ],
    "skills": {
        "regression": ["Predictive Regression", "Fitting numerics for prediction and cutomizing loss for objective optimization"],
        "classification": ["Classification Problems", "Multi class classification using traditional ML and neural networks"],
        "clustering": ["Clustering", "Supervised and unsupervised data clustering for visualization & further analysis"],
        "time_series": ["Time Series Analysis", "Time sequence based trend & seasonality analysis using ARIMA, Prophet and so on"],
        "topic_modeling": ["Topic Modeling", "Visualized dimensionality reduction for feature engineering & data assessment"],
        "anomaly_detection": ["Anomaly Detection", "Refining data & excluding anomalies for model training and data auditing"]
    },
    "projects": {
        "widget_maintenance": ["Predictive Widget Maintenance",
            "https://github.com/telenovelachuan/predictive_widget_maintenance",
            "A data science project on the widget maintenance dataset to explore feature trends of its data generating system and predict the units failure probability and time sequence trends.",
            ["clustering", "regression", "time series"]
        ],
        "worldwide_products": ["Worldwide Products Trend",
            "https://github.com/telenovelachuan/worldwide_products",
            "A data science project on the manufacturing product demand dataset to explore the seasonal trend in features and build time series model to predict the product demands.",
            ["time series"]
        ],
        "the_oscars": ["The Oscars",
            "https://github.com/telenovelachuan/the_oscars",
            "Conducting topic modeling further on the Shakespeare play dataset, and applying data storytelling for interactive topic visualization.",
            ["topic modeling", "visualization"]
        ],
        "major_leagues": ["European Football Score Prediction",
            "https://github.com/telenovelachuan/major_leagues",
            "European football data mining and aggregation on Premier League, Champions League and other tournament data provided by soccer SPI. Full time match score prediction using boosting techniques and regression networks.",
            ["regression"]
        ],
        "shakespear_plays": ["To Be, or Not to Be",
            "https://github.com/telenovelachuan/shakespear_plays",
            "Exploring all Shakespeare plays text for recognizing useful features and predicting the player out of the play lines using classification models.",
            ["classification"]
        ],
        "news_headline": ["News Headline Extraction",
            "https://github.com/telenovelachuan/Eluvio_DS_Challenge",
            "Topic modeling project on the news title headline dataset to explore title feature information and discover yearly topics using natural language processing models.",
            ["topic modeling"]
        ],
        "dream_of_anomalies": ["Dreams of Anomalies",
            "https://github.com/telenovelachuan/dream_of_anomalies",
            "A data science project on applying anomaly detection techniques on the website streaming dataset to discover abnormal data samples.",
            ["anomaly detection"]
        ],
        "dynamic_duo": ["Dynamic Duo",
            "https://github.com/dynamic-duo-data-science/dynamicduo",
            "Analyzing & diagnosing US cross border entry data from 1996 to 2019 for US border entry prediction, time series analysis and visualized storytelling.",
            ["anomaly detection", "regression", "time series", "visualization"]
        ]
    }
}